---
kind: other
id: Methods.T:Autodesk.Revit.DB.Visual.AssetProperties
source: html/f99bc636-05d9-5340-d327-6bfa912e4f4d.htm
---
# AssetProperties Methods

Adds a new connected asset attached to this asset property, if it allows it.